\ufeff# Properties Source File for Russian
# Generate the properties file from this file using the following command:
# native2ascii -encoding UTF-8 AnimalResources_ru.source AnimalResources_ru.properties
AnimalDemo=\u0414\u0435\u043c\u043e\u043d\u0441\u0442\u0440\u0430\u0446\u0438\u044f \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445
No=\u041d\u0435\u0442
Yes=\u0414\u0430
Next=\u0421\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439
Prev=\u041f\u0440\u0435\u0434\u044b\u0434\u0443\u0449\u0438\u0435
Restart=\u041f\u0435\u0440\u0435\u0437\u0430\u043f\u0443\u0441\u0442\u0438\u0442\u0435
WelcomeMessage=\u0414\u043e\u0431\u0440\u043e \u043f\u043e\u0436\u0430\u043b\u043e\u0432\u0430\u0442\u044c \u0432 \u0414\u0432\u0438\u0433\u0430\u0442\u0435\u043b\u044c \u0414\u0438\u0430\u0433\u043d\u043e\u0437 \u044d\u043a\u0441\u043f\u0435\u0440\u0442\u043e\u0432 \u0421\u0438\u0441\u0442\u0435\u043c\u044b.
backbone.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0438\u043c\u0435\u044e\u0442 \u043e\u0441\u043d\u043e\u0432\u0443?
warm.blooded.query=\u042f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043b\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u0442\u0435\u043f\u043b\u043e \u0436\u0435\u0441\u0442\u043e\u043a\u043e\u0433\u043e?
live.prime.in.soil.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0435 \u0436\u0438\u0432\u0443\u0442 \u0432 \u043e\u0441\u043d\u043e\u0432\u043d\u043e\u043c \u0432 \u0437\u0435\u043c\u043b\u0435?
has.breasts.query=\u041a\u0430\u043a \u043f\u0440\u0430\u0432\u0438\u043b\u043e, \u043d\u0435 \u0436\u0435\u043d\u0441\u043a\u043e\u0433\u043e \u0432\u0430\u0448\u0435\u0433\u043e \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e \u043c\u0435\u0434\u0441\u0435\u0441\u0442\u0440\u0430 \u0435\u0435 \u043c\u043e\u043b\u043e\u0434\u044b\u0435 \u0441 \u043c\u043e\u043b\u043e\u043a\u043e\u043c?
always.in.water.query=\u042f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043b\u0438 \u0412\u0430\u0448 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u0432\u0441\u0435\u0433\u0434\u0430 \u0432 \u0432\u043e\u0434\u0435?
flat.bodied.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0438\u043c\u0435\u044e\u0442 \u043f\u043b\u043e\u0441\u043a\u0443\u044e \u0442\u0435\u043b\u0430?
body.in.segments.query=\u042f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043b\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u0442\u0435\u043b\u043e \u0432 \u0441\u043b\u043e\u044f\u0445?
can.eat.meat.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0435\u0434\u044f\u0442 \u043a\u0440\u0430\u0441\u043d\u043e\u0435 \u043c\u044f\u0441\u043e?
boney.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0435\u0441\u0442\u044c boney \u0441\u043a\u0435\u043b\u0435\u0442?
scaly.query=\u042f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043b\u0438 \u0412\u0430\u0448 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e \u043f\u043e\u043a\u0440\u044b\u0442\u043e \u043c\u0430\u0441\u0448\u0442\u0430\u0431\u0438\u0440\u0443\u0435\u0442\u0441\u044f \u043a\u043e\u0436\u0443?
shell.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0438\u043c\u0435\u044e\u0442 \u043e\u0431\u043e\u043b\u043e\u0447\u043a\u0443?
digest.cells.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445, \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u0435 \u043c\u043d\u043e\u0433\u0438\u0445 \u043a\u043b\u0435\u0442\u043e\u043a \u0443\u0441\u0432\u0430\u0438\u0432\u0430\u0442\u044c \u0435\u0435 \u043f\u0438\u0442\u0430\u043d\u0438\u0435, \u0430 \u043d\u0435 \u0436\u0438\u0432\u043e\u0442?
fly.query=\u041c\u043e\u0436\u0435\u0442 \u043b\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u043b\u0435\u0442\u0435\u0442\u044c?
hooves.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0438\u043c\u0435\u044e\u0442 \u043a\u043e\u043f\u044b\u0442\u0430?
rounded.shell.query=\u0418\u043c\u0435\u0435\u0442 \u043b\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0435\u0441\u0442\u044c \u043e\u043a\u0440\u0443\u0433\u043b\u044f\u044e\u0442\u0441\u044f \u043e\u0431\u043e\u043b\u043e\u0447\u043a\u0435?
jump.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u043f\u0440\u044b\u0433\u0430\u0442\u044c?
tail.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0435\u0441\u0442\u044c \u0445\u0432\u043e\u0441\u0442?
stationary.query=\u042f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043b\u0438 \u0412\u0430\u0448 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u043f\u0440\u0438\u0434\u0430\u0435\u0442 \u043f\u043e\u0441\u0442\u043e\u044f\u043d\u043d\u043e \u043d\u0430 \u043e\u0431\u044a\u0435\u043a\u0442?
multicelled.query=\u042f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043b\u0438 \u0412\u0430\u0448 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445, \u0432 \u0441\u043e\u0441\u0442\u0430\u0432\u0435 \u0431\u043e\u043b\u0435\u0435 \u0447\u0435\u043c \u043e\u0434\u043d\u043e\u0439 \u044f\u0447\u0435\u0439\u043a\u0435?
opposing.thumb.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0438\u043c\u0435\u044e\u0442 \u043f\u0440\u043e\u0442\u0438\u0432\u043e\u043f\u043e\u043b\u043e\u0436\u043d\u044b\u0435 \u043f\u0430\u043b\u044c\u0446\u0430?
two.toes.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0441\u0442\u043e\u044f\u0442\u044c \u043d\u0430 \u0434\u0432\u0443\u0445 \u043f\u0430\u043b\u044c\u0446\u0435\u0432 / \u043a\u043e\u043f\u044b\u0442\u0430 \u043d\u0430 \u043d\u043e\u0433\u0438?
live.in.water.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0435 \u0436\u0438\u0432\u0443\u0442 \u0432 \u0432\u043e\u0434\u0435?
limbs.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0438\u043c\u0435\u044e\u0442 \u043a\u043e\u043d\u0435\u0447\u043d\u043e\u0441\u0442\u0435\u0439?
spikes.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445, \u043a\u0430\u043a \u043f\u0440\u0430\u0432\u0438\u043b\u043e, \u0438\u043c\u0435\u044e\u0442 \u043f\u0438\u043a\u0438 \u0438\u0437\u043b\u0443\u0447\u0430\u044e\u0449\u0438\u0445 \u0438\u0437 \u0441\u0432\u043e\u0435\u0433\u043e \u0442\u0435\u043b\u0430?
spiral.shell.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0435\u0441\u0442\u044c \u0441\u043f\u0438\u0440\u0430\u043b\u044c-\u043e\u0431\u0440\u0430\u0437\u043d\u044b\u0439 \u043a\u043e\u0440\u043f\u0443\u0441?
prehensile.tail.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0435\u0441\u0442\u044c prehensile \u0445\u0432\u043e\u0441\u0442?
over.400.query=\u041b\u0438 \u0434\u043b\u044f \u0432\u0437\u0440\u043e\u0441\u043b\u044b\u0445, \u043a\u0430\u043a \u043f\u0440\u0430\u0432\u0438\u043b\u043e, \u0432\u0435\u0441 \u0431\u043e\u043b\u0435\u0435 400 \u0444\u0443\u043d\u0442\u043e\u0432?
horns.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0438\u043c\u0435\u044e\u0442 \u0440\u043e\u0433\u0430?
plating.query=\u042f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043b\u0438 \u0412\u0430\u0448 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e \u043f\u043e\u043a\u0440\u044b\u0442\u0430 \u0437\u0430\u0449\u0438\u0442\u043d\u043e\u0439 \u043e\u0431\u0448\u0438\u0432\u043a\u0438?
hunted.query=\u042f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043b\u0438 \u0412\u0430\u0448 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445, \u043a \u0441\u043e\u0436\u0430\u043b\u0435\u043d\u0438\u044e, \u043d\u0430 \u043a\u043e\u043c\u043c\u0435\u0440\u0447\u0435\u0441\u043a\u043e\u0439 \u043e\u0445\u043e\u0442\u044b?
front.teeth.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0438\u043c\u0435\u044e\u0442 \u0431\u043e\u043b\u044c\u0448\u043e\u0435 \u043f\u0435\u0440\u0435\u0434\u043d\u0438\u0445 \u0437\u0443\u0431\u043e\u0432?
bivalve.query=\u042f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043b\u0438 \u0412\u0430\u0448 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445, \u043e\u0445\u0440\u0430\u043d\u044f\u0435\u043c\u044b\u0445 \u043d\u0430 \u0434\u0432\u0435 \u043f\u043e\u043b\u043e\u0432\u0438\u043d\u044b \u043e\u0440\u0443\u0434\u0438\u0439?
nearly.hairless.query=\u042f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043b\u0438 \u0412\u0430\u0448 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u043f\u043e\u0447\u0442\u0438 \u043b\u044b\u0441\u043e\u0433\u043e?
land.based.query=\u042f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043b\u0438 \u0412\u0430\u0448 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u043d\u0430 \u0441\u0443\u0448\u0435?
thintail.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0438\u043c\u0435\u044e\u0442 \u0442\u043e\u043d\u043a\u0438\u0439 \u0445\u0432\u043e\u0441\u0442?
lives.in.desert.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445, \u043a\u0430\u043a \u043f\u0440\u0430\u0432\u0438\u043b\u043e, \u0436\u0438\u0432\u0443\u0442 \u0432 \u043f\u0443\u0441\u0442\u044b\u043d\u0435?
semi.aquatic.query=\u042f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043b\u0438 \u0412\u0430\u0448 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u043f\u043e\u043b\u0443\u0444\u0430\u0431\u0440\u0438\u043a\u0430\u0442\u043e\u0432 \u0432\u043e\u0434\u043d\u043e\u0439?
large.ears.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0438\u043c\u0435\u044e\u0442 \u0431\u043e\u043b\u044c\u0448\u0438\u0435 \u0443\u0448\u0438?
pouch.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0435\u0441\u0442\u044c \u0441\u0443\u043c\u043e\u0447\u043a\u0430?
long.powerful.arms.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0443\u0436\u0435 \u0434\u0430\u0432\u043d\u043e, \u043c\u043e\u0449\u043d\u044b\u043c \u043e\u0440\u0443\u0436\u0438\u0435\u043c?
fleece.query=\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u0439 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0438\u043c\u0435\u044e\u0442 \u0448\u0435\u0440\u0441\u0442\u0438?
domesticated.query=\u042f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043b\u0438 \u0412\u0430\u0448 \u043e\u0434\u043e\u043c\u0430\u0448\u043d\u0435\u043d\u043d\u044b\u0445 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445?
bird=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043f\u0442\u0438\u0446\u0430.
flatworm=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f flatworm.
worm.leech=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0447\u0435\u0440\u0432\u044c \u0438\u043b\u0438 \u043f\u0438\u044f\u0432\u043a\u0438.
fish=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0440\u044b\u0431\u0430.
shark.ray=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0430\u043a\u0443\u043b \u0438\u043b\u0438 \u043b\u0443\u0447.
centipede.millipede.insect=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f centipede \u0438\u043b\u0438 millipede \u0438\u043b\u0438 \u043d\u0430\u0441\u0435\u043a\u043e\u043c\u044b\u0445.
bat=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0431\u0438\u0442\u043e\u0439.
turtle=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0447\u0435\u0440\u0435\u043f\u0430\u0445\u0430.
frog=\u042f \u0434\u0443\u043c\u0430\u044e, \u0412\u0430\u0448\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u043b\u044f\u0433\u0443\u0448\u0435\u043a.
salamander=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0441\u0430\u043b\u0430\u043c\u0430\u043d\u0434\u0440\u0430.
lobster=\u042f \u0434\u0443\u043c\u0430\u044e, \u0412\u0430\u0448\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u043b\u043e\u0431\u0441\u0442\u0435\u0440.
crab=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u043c \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043a\u0440\u0430\u0431.
jellyfish=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043c\u0435\u0434\u0443\u0437.
protozoa=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043f\u0440\u043e\u0441\u0442\u0435\u0439\u0448\u0438\u0435.
crocodile.alligator=\u042f \u0434\u0443\u043c\u0430\u044e, \u0412\u0430\u0448\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u043a\u0440\u043e\u043a\u043e\u0434\u0438\u043b\u0430 \u0438\u043b\u0438 \u0430\u043b\u043b\u0438\u0433\u0430\u0442\u043e\u0440.
snake=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0437\u043c\u0435\u044f.
sea.anemone=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e \u043c\u043e\u0440\u0441\u043a\u043e\u0433\u043e \u0430\u043d\u0435\u043c\u043e\u043d\u0430.
coral.sponge=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043a\u043e\u0440\u0430\u043b\u043b\u043e\u0432\u044b\u0445 \u0438\u043b\u0438 \u0433\u0443\u0431\u043a\u043e\u0439.
snail=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0443\u043b\u0438\u0442\u043a\u0430.
monkey=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043e\u0431\u0435\u0437\u044c\u044f\u043d\u0430.
rhinoceros=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043d\u043e\u0441\u043e\u0440\u043e\u0433.
horse.zebra=\u042f \u0434\u0443\u043c\u0430\u044e, \u0412\u0430\u0448\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u043b\u043e\u0448\u0430\u0434\u044c, \u0437\u0435\u0431\u0440\u0430.
whale=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u043c \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043a\u0438\u0442.
dolphin.porpoise=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u043c \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0434\u0435\u043b\u044c\u0444\u0438\u043d \u0438\u043b\u0438 \u043c\u043e\u0440\u0441\u043a\u0430\u044f \u0441\u0432\u0438\u043d\u043a\u0430.
clam.oyster=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0441\u044d\u043d\u0434\u0432\u0438\u0447 \u0438\u043b\u0438 \u0423\u0441\u0442\u0440\u0438\u0446\u0430.
squid.octopus=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043a\u0430\u043b\u044c\u043c\u0430\u0440\u0430 \u0438\u043b\u0438 \u043e\u0441\u044c\u043c\u0438\u043d\u043e\u0433\u0430.
man=\u042f \u0434\u0443\u043c\u0430\u044e, \u0412\u0430\u0448\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u0435\u0441\u0442\u044c \u0447\u0435\u043b\u043e\u0432\u0435\u043a.
bear.tiger.lion=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e \u043c\u0435\u0434\u0432\u0435\u0434\u044f \u0438\u043b\u0438 \u0442\u0438\u0433\u0440\u0430 \u0438\u043b\u0438 \u043b\u044c\u0432\u0430.
walrus=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043c\u043e\u0440\u0436\u0435\u0439.
cat=\u042f \u0434\u0443\u043c\u0430\u044e, \u0412\u0430\u0448\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u043a\u043e\u0448\u043a\u0430.
coyote.wolf.fox.dog=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f coyote \u0438\u043b\u0438 \u0432\u043e\u043b\u043a\u0430 \u0438\u043b\u0438 \u043b\u0438\u0441\u0443 \u0438\u043b\u0438 \u0441\u043e\u0431\u0430\u043a\u0443.
camel=\u042f \u0434\u0443\u043c\u0430\u044e, \u0412\u0430\u0448\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u0432\u0435\u0440\u0431\u043b\u044e\u0434\u0430.
giraffe=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0436\u0438\u0440\u0430\u0444\u0430.
hippopotamus=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f hippopotamus.
rabbit=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043a\u0440\u043e\u043b\u0438\u043a.
rat.mouse.squirrel.beaver.porcupine=\u042f \u0434\u0443\u043c\u0430\u044e, \u0412\u0430\u0448\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u043a\u0440\u044b\u0441\u0430 \u0438\u043b\u0438 \u043c\u044b\u0448\u044c \u0438\u043b\u0438 \u0431\u0435\u043b\u043a\u0430 \u0438\u043b\u0438 \u0431\u043e\u0431\u0440\u0430 \u0438\u043b\u0438 \u0434\u0438\u043a\u043e\u0431\u0440\u0430\u0437.
kangaroo.koala.bear=\u042f \u0434\u0443\u043c\u0430\u044e, \u0412\u0430\u0448\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u043a\u0435\u043d\u0433\u0443\u0440\u0443 \u0438 \u043a\u043e\u0430\u043b\u0443 \u043c\u0435\u0434\u0432\u0435\u0434\u044c.
mole.shrew.elephant=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043c\u043e\u043b\u044c \u0438\u043b\u0438 \u0437\u0435\u043c\u043b\u0435\u0440\u043e\u0439\u043a\u0438 \u0438\u043b\u0438 \u0441\u043b\u043e\u043d\u0430.
orangutan.gorilla.chimpanzee=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043e\u0440\u0430\u043d\u0433\u0443\u0442\u0430\u043d\u0433\u043e\u0432 \u0438 \u0433\u043e\u0440\u0438\u043b\u043b \u0438\u043b\u0438 \u0448\u0438\u043c\u043f\u0430\u043d\u0437\u0435.
baboon=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0431\u0430\u0431\u0443\u0438\u043d.
sheep.goat=\u042f \u0434\u0443\u043c\u0430\u044e, \u0412\u0430\u0448\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u043e\u0432\u0446\u0443 \u0438\u043b\u0438 \u043a\u043e\u0437\u0443.
cow=\u042f \u0434\u0443\u043c\u0430\u044e, \u0432\u0430\u0448\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e \u043a\u043e\u0440\u043e\u0432\u0443.
deer.moose.antelope=\u042f \u0434\u0443\u043c\u0430\u044e, \u0412\u0430\u0448\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u043e\u043b\u0435\u043d\u044f \u0438\u043b\u0438 \u043b\u043e\u0441\u044f \u0438\u043b\u0438 \u0430\u043d\u0442\u0438\u043b\u043e\u043f\u0430.
