\ufeff# Properties Source File for Spanish
# Generate the properties file from this file using the following command:
# native2ascii -encoding UTF-8 AnimalResources_es.source AnimalResources_es.properties
AnimalDemo=Demostraci\u00f3n de Animales
No=No
Yes=S\u00ed
Next=Siguiente
Prev=Anterior
Restart=Reiniciar
WelcomeMessage=Bienvenidos al Sistema de Experto de Identificaci\u00f3n de Animales.
backbone.query=\u00bfSu animal tiene una columna vertebral?
warm.blooded.query=Es el animal de sangre caliente?
live.prime.in.soil.query=\u00bfSu animal vive principalmente en el suelo?
has.breasts.query=Normalmente, \u00bfel animal hembra de su enfermera joven con su leche?
always.in.water.query=\u00bfEst\u00e1 su animal siempre en el agua?
flat.bodied.query=\u00bfSu animal tiene un piso?
body.in.segments.query=\u00bfEs el cuerpo del animal en los segmentos?
can.eat.meat.query=\u00bfSu animal comer carne roja?
boney.query=\u00bfSu animal tiene un boney esqueleto?
scaly.query=\u00bfEst\u00e1 su escala animal cubierto de piel?
shell.query=\u00bfSu animal tiene un shell?
digest.cells.query=\u00bfSu uso de animales muchas c\u00e9lulas de digerir su comida en lugar de una de est\u00f3mago?
fly.query=\u00bfPuede su animal volar?
hooves.query=\u00bfSu animal tiene pezu\u00f1as?
rounded.shell.query=\u00bfEl animal tiene una concha redondeada?
jump.query=\u00bfSu animal saltar?
tail.query=\u00bfSu animal tiene una cola?
stationary.query=\u00bfSu animal adjunta permanentemente a un objeto?
multicelled.query=\u00bfSu animal formada por m\u00e1s de una c\u00e9lula?
opposing.thumb.query=\u00bfSu animal tiene una de las contrapartes pulgar?
two.toes.query=\u00bfSu animal de pie en dos dedos de los pies o pezu\u00f1as por pie?
live.in.water.query=\u00bfSu animal viven en el agua?
limbs.query=\u00bfSu animal tiene extremidades?
spikes.query=\u00bfSu animal normalmente tienen picos de radiaci\u00f3n de su cuerpo?
spiral.shell.query=\u00bfSu animal tiene una espiral en forma de concha?
prehensile.tail.query=\u00bfSu animal tiene una cola prensil?
over.400.query=\u00bfUn adulto suele pesar m\u00e1s de 400 libras?
horns.query=\u00bfSu animal tiene cuernos?
plating.query=\u00bfSu animal cubierto con una protecci\u00f3n de galvanizado?
hunted.query=\u00bfEst\u00e1 su animal, por desgracia, la caza comercial?
front.teeth.query=\u00bfSu animal tiene grandes dientes frontales?
bivalve.query=\u00bfSu animal protegido por dos medias conchas?
nearly.hairless.query=\u00bfSu animal casi sin pelo?
land.based.query=Es tu animal terrestre?
thintail.query=\u00bfSu animal tiene una cola delgada?
lives.in.desert.query=\u00bfSu animal suele vivir en el desierto?
semi.aquatic.query=\u00bfSu animal semi-acu\u00e1tico?
large.ears.query=\u00bfSu animal tiene orejas grandes?
pouch.query=\u00bfSu animal tiene una bolsa?
long.powerful.arms.query=\u00bfSu animal desde hace tiempo, de gran alcance armas?
fleece.query=\u00bfSu animal tiene un forro polar?
domesticated.query=\u00bfSu animal domesticado?
bird=Creo que su animal es un ave.
flatworm=Creo que su animal es un flatworm.
worm.leech=Creo que su animal es un gusano o baluma.
fish=Creo que su animal es un pez.
shark.ray=Creo que su animal es un tibur\u00f3n o de rayos.
centipede.millipede.insect=Creo que su animal es un centipede o millipede o insectos.
bat=Creo que su animal es un murci\u00e9lago.
turtle=Creo que su animal es una tortuga.
frog=Creo que su animal es una rana.
salamander=Creo que su animal es una salamandra.
lobster=Creo que su animal es una langosta.
crab=Creo que su animal es un cangrejo.
jellyfish=Creo que su animal es una medusa.
protozoa=Creo que su animal es un protozoo.
crocodile.alligator=Creo que su animal es un cocodrilo o caim\u00e1n.
snake=Creo que su animal es una serpiente.
sea.anemone=Creo que su animal es una an\u00e9mona de mar.
coral.sponge=Creo que su animal es un coral o una esponja.
snail=Creo que su animal es un caracol.
monkey=Creo que su animal es un mono.
rhinoceros=Creo que su animal es un rinoceronte.
horse.zebra=Creo que su animal es un caballo o cebra.
whale=Creo que su animal es una ballena.
dolphin.porpoise=Creo que su animal es un delf\u00edn o marsopa.
clam.oyster=Creo que su animal es un ostras o almejas.
squid.octopus=Creo que su animal es un calamar o pulpo.
man=Creo que su animal es un hombre.
bear.tiger.lion=Creo que su animal es un oso o tigre o le\u00f3n.
walrus=Creo que su animal es una morsa.
cat=Creo que su animal es un gato.
coyote.wolf.fox.dog=Creo que su animal es un coyote o el lobo o el zorro o perro.
camel=Creo que su animal es un camello.
giraffe=Creo que su animal es una jirafa.
hippopotamus=Creo que su animal es un hipop\u00f3tamo.
rabbit=Creo que su animal es un conejo.
rat.mouse.squirrel.beaver.porcupine=Creo que su animal es un rat\u00f3n o rata o ardilla o castor o puercoesp\u00edn.
kangaroo.koala.bear=Creo que su animal es un oso koala o el canguro.
mole.shrew.elephant=Creo que su animal es un lunar o shrew o elefante.
orangutan.gorilla.chimpanzee=Creo que su animal es un orangut\u00e1n o gorila o chimpanc\u00e9.
baboon=Creo que su animal es un babuinos.
sheep.goat=Creo que su animal es una oveja o cabra.
cow=Creo que su animal es una vaca.
deer.moose.antelope=Creo que su animal es un ciervo o alce o de ant\u00edlope.
