\ufeff# Properties Source File for Japanese
# Generate the properties file from this file using the following command:
# native2ascii -encoding UTF-8 AnimalResources_ja.source AnimalResources_ja.properties
AnimalDemo=\u52d5\u7269\u30c7\u30e2
No=\u3044\u3044\u3048
Yes=\u306f\u3044
Next=\u6b21\u306e
Prev=\u524d\u306e
Restart=\u518d\u8d77\u52d5
WelcomeMessage=\u30a8\u30ad\u30b9\u30d1\u30fc\u30c8\u30b7\u30b9\u30c6\u30e0\u540c\u5b9a\u52d5\u7269\u3078\u3088\u3046\u3053\u305d\u3002
backbone.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u30d0\u30c3\u30af\u30dc\u30fc\u30f3\u3092\u6301\u3064\u52d5\u7269\u3067\u3059\u304b\uff1f
warm.blooded.query=\u7d14\u8840\u306e\u52d5\u7269\u306f\u6696\u304b\u3044\u3067\u3059\u304b\uff1f
live.prime.in.soil.query=\u4e3b\u306f\u3042\u306a\u305f\u306e\u4f4f\u3093\u3067\u571f\u58cc\u52d5\u7269\u3067\u3059\u304b\uff1f
has.breasts.query=\u901a\u5e38\u3001\u52d5\u7269\u770b\u8b77\u5e2b\u306f\u3001\u305d\u306e\u82e5\u3044\u5973\u6027\u306e\u304a\u5ba2\u69d8\u306b\u725b\u4e73\u3067\u3059\u304b\uff1f
always.in.water.query=\u6c34\u306b\u306f\u3001\u5e38\u306b\u304a\u5ba2\u69d8\u306e\u52d5\u7269\u3067\u3059\u304b\uff1f
flat.bodied.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u52d5\u7269\u304c\u3042\u308b\u30d5\u30e9\u30c3\u30c8\u30dc\u30c7\u30a3\u3067\u3059\u304b\uff1f
body.in.segments.query=\u30bb\u30b0\u30e1\u30f3\u30c8\u306f\u3001\u52d5\u7269\u306e\u4f53\u306e\u4e2d\u3067\u3059\u304b\uff1f
can.eat.meat.query=\u304a\u5ba2\u69d8\u306e\u52d5\u7269\u306e\u8089\u3092\u98df\u3079\u308b\u306e\u306f\u8d64\u3067\u3059\u304b\uff1f
boney.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u52d5\u7269boney\u9aa8\u683c\u304c\u3042\u308b\u304b\uff1f
scaly.query=\u62e1\u5927\u7e2e\u5c0f\u3057\u3066\u52d5\u7269\u306e\u76ae\u3067\u8986\u308f\u308c\u3066\u306f\uff1f
shell.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u30b7\u30a7\u30eb\u304c\u3042\u308b\u52d5\u7269\u3067\u3059\u304b\uff1f
digest.cells.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u52d5\u7269\u306e\u7d30\u80de\u3092\u4f7f\u3063\u3066\u591a\u304f\u306e\u98df\u54c1\u3067\u306f\u306a\u304f\u3001\u80c3\u306e\u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u3067\u3059\u304b\uff1f
fly.query=\u30b8\u30e3\u30f3\u30d7\u3057\u3066\u52d5\u7269\u306e\u3053\u3068\u3067\u3059\u304b\uff1f
hooves.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u52d5\u7269\u304c\u3072\u3065\u3081\u306e\u3067\u3059\u304b\uff1f
rounded.shell.query=\u4e38\u3044\u30b7\u30a7\u30eb\u306f\u3001\u52d5\u7269\u304c\u3042\u308b\u304b\uff1f
jump.query=\u30b8\u30e3\u30f3\u30d7\u3057\u3066\u52d5\u7269\u306f\uff1f
tail.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u52d5\u7269\u306e\u3057\u3063\u307d\u304c\u3042\u308b\u304b\uff1f
stationary.query=\u6c38\u4e45\u306b\u306f\u3001\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u6dfb\u4ed8\u3057\u3066\u52d5\u7269\u3067\u3059\u304b\uff1f
multicelled.query=\u3042\u306a\u305f\u306e\u524d\u306b\u306f\u3001\u52d5\u7269\u306e\u7d30\u80de\u306e1\u3064\u4ee5\u4e0a\u306e\u30a2\u30c3\u30d7\u3067\u3059\u304b\uff1f
opposing.thumb.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u52d5\u7269\u3092\u6301\u3063\u3066\u5bfe\u6297\u3057\u3066\u3044\u308b\u89aa\u6307\u3067\u3059\u304b\uff1f
two.toes.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u52d5\u7269\u306e\u4e0a\u306b\u7acb\u30642\u3064\u306e\u3064\u307e\u5148/\u3072\u3065\u3081\u306e\u8db3\u306e\u3042\u305f\u308a\u3067\u3059\u304b\uff1f
live.in.water.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u6c34\u306b\u4f4f\u3093\u3067\u3044\u308b\u52d5\u7269\u3067\u3059\u304b\uff1f
limbs.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u52d5\u7269\u304c\u624b\u8db3\u3067\u3059\u304b\uff1f
spikes.query=\u30b9\u30d1\u30a4\u30af\u304c\u3001\u901a\u5e38\u306f\u304a\u5ba2\u69d8\u306e\u52d5\u7269\u306e\u4f53\u5185\u304b\u3089\u653e\u5c04\u3067\u3059\u304b\uff1f
spiral.shell.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u52d5\u7269\u304c\u3042\u308b\u3089\u305b\u3093\u72b6\u306e\u30b7\u30a7\u30eb\u3067\u3059\u304b\uff1f
prehensile.tail.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u3069\u3093\u6b32\u306a\u5c3e\u3092\u6301\u3064\u52d5\u7269\u3067\u3059\u304b\uff1f
over.400.query=\u5927\u4eba\u306b\u306f\u3001\u901a\u5e38\u4ee5\u4e0a\u306e\u91cd\u3055\u56db\u3007 \u3007\u30dd\u30f3\u30c9\u3067\u3059\u304b\uff1f
horns.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u52d5\u7269\u304c\u89d2\u3067\u3059\u304b\uff1f
plating.query=\u4fdd\u8b77\u52d5\u7269\u3067\u8986\u308f\u308c\u3066\u306f\u3001\u304a\u5ba2\u69d8\u306e\u30e1\u30c3\u30ad\u3067\u3059\u304b\uff1f
hunted.query=\u3042\u306a\u305f\u306e\u52d5\u7269\u304c\u3001\u6b8b\u5ff5\u306a\u3053\u3068\u306b\u3001\u5546\u696d\u7684\u3084\u3064\u308c\u305f\u304b\uff1f
front.teeth.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u52d5\u7269\u306b\u306f\u5927\u304d\u306a\u524d\u6b6f\u3067\u3059\u304b\uff1f
bivalve.query=\u3042\u306a\u305f\u306e\u52d5\u7269\u304c\u4fdd\u8b77\u3055\u308c\u30662\u3064\u306e\u30cf\u30fc\u30d5\u30b7\u30a7\u30eb\u3067\u3059\u304b\uff1f
nearly.hairless.query=\u3042\u306a\u305f\u306e\u8fd1\u304f\u306b\u306f\u3001\u52d5\u7269\u306e\u6bdb\u306e\u3067\u3059\u304b\uff1f
land.based.query=\u52d5\u7269\u306f\u3001\u304a\u5ba2\u69d8\u306e\u571f\u5730\u3092\u30d9\u30fc\u30b9\u3067\u3059\u304b\uff1f
thintail.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u8584\u3044\u5c3e\u3092\u6301\u3064\u52d5\u7269\u3067\u3059\u304b\uff1f
lives.in.desert.query=\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u901a\u5e38\u306e\u7802\u6f20\u306b\u4f4f\u3093\u3067\u3044\u308b\u304b\uff1f
semi.aquatic.query=\u534a\u6c34\u751f\u52d5\u7269\u306f\u3042\u306a\u305f\u306e\u3067\u3059\u304b\uff1f
large.ears.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u52d5\u7269\u306b\u306f\u5927\u304d\u306a\u8033\u304b\uff1f
pouch.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u52d5\u7269\u304c\u3042\u308b\u56a2\uff1f
long.powerful.arms.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u52d5\u7269\u304c\u9577\u3044\u9593\u3001\u5f37\u529b\u306a\u6b66\u5668\u3067\u3059\u304b\uff1f
fleece.query=\u3042\u306a\u305f\u304c\u304a\u4f7f\u3044\u306e\u52d5\u7269\u304c\u30d5\u30ea\u30fc\u30b9\u3067\u3059\u304b\uff1f
domesticated.query=\u5bb6\u5ead\u7684\u306a\u52d5\u7269\u306f\u3042\u306a\u305f\u306e\u3067\u3059\u304b\uff1f
bird=\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u9ce5\u3060\u3068\u601d\u3046\u3002
flatworm=\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u6241\u5f62\u52d5\u7269\u3060\u3068\u601d\u3046\u3002
worm.leech=\u3068\u601d\u3046\u52d5\u7269\u306f\u3001\u30ef\u30fc\u30e0\u3084\u30ea\u30fc\u30c1\u3057\u3066\u3044\u308b\u3002
fish=\u304a\u5ba2\u69d8\u306f\u3001\u9b5a\u306e\u52d5\u7269\u3060\u3068\u601d\u3046\u3002
shark.ray=\u3068\u601d\u3046\u52d5\u7269\u306f\u3001\u30b5\u30e1\u3084\u30ec\u30a4\u3057\u3066\u3044\u308b\u3002
centipede.millipede.insect=\u79c1\u306f\u3042\u306a\u305f\u306e\u52d5\u7269\u3084\u6606\u866b\u306f\u3001\u30e0\u30ab\u30c7\u3084\u30e4\u30b9\u30c7\u3002
bat=\u30b3\u30a6\u30e2\u30ea\u306f\u3001\u304a\u5ba2\u69d8\u306e\u52d5\u7269\u3060\u3068\u601d\u3046\u3002
turtle=\u30a6\u30df\u30ac\u30e1\u306f\u3001\u304a\u5ba2\u69d8\u306e\u52d5\u7269\u3060\u3068\u601d\u3046\u3002
frog=\u30ab\u30a8\u30eb\u306f\u3001\u304a\u5ba2\u69d8\u306e\u52d5\u7269\u3060\u3068\u601d\u3046\u3002
salamander=\u30b5\u30f3\u30b7\u30e7\u30a6\u30a6\u30aa\u306f\u3001\u304a\u5ba2\u69d8\u306e\u52d5\u7269\u3060\u3068\u601d\u3046\u3002
lobster=\u304a\u5ba2\u69d8\u306e\u30ed\u30d6\u30b9\u30bf\u30fc\u306f\u3001\u52d5\u7269\u3060\u3068\u601d\u3046\u3002
crab=\u30ab\u30cb\u306f\u3001\u304a\u5ba2\u69d8\u306e\u52d5\u7269\u3060\u3068\u601d\u3046\u3002
jellyfish=\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30af\u30e9\u30b2\u3060\u3068\u601d\u3046\u3002
protozoa=\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u539f\u751f\u52d5\u7269\u3060\u3068\u601d\u3046\u3002
crocodile.alligator=\u3068\u601d\u3046\u52d5\u7269\u306f\u3001\u30ef\u30cb\u3084\u30ef\u30cb\u3057\u3066\u3044\u308b\u3002
snake=\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30d8\u30d3\u3060\u3068\u601d\u3046\u3002
sea.anemone=\u52d5\u7269\u3060\u3068\u601d\u3046\u304c\u3001\u30a4\u30bd\u30ae\u30f3\u30c1\u30e3\u30af\u3057\u3066\u3044\u308b\u3002
coral.sponge=\u3068\u601d\u3046\u52d5\u7269\u306f\u3001\u30b5\u30f3\u30b4\u3084\u30b9\u30dd\u30f3\u30b8\u3057\u3066\u3044\u308b\u3002
snail=\u30ab\u30bf\u30c4\u30e0\u30ea\u306f\u3001\u304a\u5ba2\u69d8\u306e\u52d5\u7269\u3060\u3068\u601d\u3046\u3002
monkey=\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30b5\u30eb\u3060\u3068\u601d\u3046\u3002
rhinoceros=\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30b5\u30a4\u3060\u3068\u601d\u3046\u3002
horse.zebra=\u3068\u601d\u3046\u52d5\u7269\u306f\u3001\u99ac\u3084\u30b7\u30de\u30a6\u30de\u3057\u3066\u3044\u308b\u3002
whale=\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30af\u30b8\u30e9\u3068\u601d\u3046\u3002
dolphin.porpoise=\u3068\u601d\u3046\u52d5\u7269\u306f\u3001\u30a4\u30eb\u30ab\u3084\u30a4\u30eb\u30ab\u3057\u3066\u3044\u308b\u3002
clam.oyster=\u3068\u601d\u3046\u52d5\u7269\u306f\u3001\u30cf\u30de\u30b0\u30ea\u3084\u30ab\u30ad\u3057\u3066\u3044\u308b\u3002
squid.octopus=\u3068\u601d\u3046\u52d5\u7269\u306f\u3001\u30a4\u30ab\u3084\u30bf\u30b3\u3057\u3066\u3044\u308b\u3002
man=\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u4e00\u4eba\u306e\u7537\u3060\u3068\u601d\u3046\u3002
bear.tiger.lion=\u79c1\u306f\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30af\u30de\u3084\u30c8\u30e9\u3084\u30e9\u30a4\u30aa\u30f3\u3067\u3059\u3002
walrus=\u30bb\u30a4\u30a6\u30c1\u306f\u3001\u304a\u5ba2\u69d8\u306e\u52d5\u7269\u3060\u3068\u601d\u3046\u3002
cat=\u732b\u306f\u3001\u52d5\u7269\u3060\u3068\u601d\u3046\u3057\u3066\u3044\u308b\u3002
coyote.wolf.fox.dog=\u79c1\u306f\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30b3\u30e8\u30fc\u30c6\u3084\u30aa\u30aa\u30ab\u30df\u3084\u30ad\u30c4\u30cd\u3084\u72ac\u3067\u3059\u3002
camel=\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30e9\u30af\u30c0\u3068\u601d\u3046\u3002
giraffe=\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30ad\u30ea\u30f3\u3068\u601d\u3046\u3002
hippopotamus=\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30ab\u30d0\u3060\u3068\u601d\u3046\u3002
rabbit=\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30a6\u30b5\u30ae\u3060\u3068\u601d\u3046\u3002
rat.mouse.squirrel.beaver.porcupine=\u79c1\u306f\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30e9\u30c3\u30c8\u3084\u30de\u30a6\u30b9\u3084\u30ea\u30b9\u3084\u30d3\u30fc\u30d0\u30fc\u3084\u5c71\u5d50\u3002
kangaroo.koala.bear=\u79c1\u306f\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30ab\u30f3\u30ac\u30eb\u30fc\u3084\u30b3\u30a2\u30e9\u3002
mole.shrew.elephant=\u79c1\u306f\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30e2\u30b0\u30e9\u3084\u30cd\u30ba\u30df\u3084\u8c61\u3067\u3059\u3002
orangutan.gorilla.chimpanzee=\u79c1\u306f\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30b4\u30ea\u30e9\u3084\u30c1\u30f3\u30d1\u30f3\u30b8\u30fc\u3084\u30aa\u30e9\u30f3\u30a6\u30fc\u30bf\u30f3\u3002
baboon=\u30d2\u30d2\u306f\u3001\u304a\u5ba2\u69d8\u306e\u52d5\u7269\u3060\u3068\u601d\u3046\u3002
sheep.goat=\u3068\u601d\u3046\u52d5\u7269\u306f\u3001\u7f8a\u3084\u30e4\u30ae\u3057\u3066\u3044\u308b\u3002
cow=\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u725b\u306e\u3060\u3068\u601d\u3046\u3002
deer.moose.antelope=\u79c1\u306f\u3042\u306a\u305f\u306e\u52d5\u7269\u306f\u3001\u30b7\u30ab\u3084\u30e0\u30fc\u30b9\u3084\u30a2\u30f3\u30c6\u30ed\u30fc\u30d7\u3002
